[{"id":"aeb93860-3d85-4973-a3e2-cf9b9a09a18a","title":"Kung Fu","description":"A Chinese martial art that emphasizes fluid movements and incorporates strikes, kicks, throws, and joint locks. Kung Fu also includes weapons training and meditation. It has many different styles and is often used in films and popular culture."},{"id":"cfa6c2b2-614a-46f7-b8f9-9b1af68dcf6a","title":"Muay Thai","description":"A Thai martial art that focuses on striking techniques such as punches, kicks, elbows, and knee strikes. Muay Thai also incorporates clinching and throwing. It is often called the 'art of eight limbs' due to the many techniques it uses."},{"id":"ee2c85d6-c266-4c9f-908f-6d4e2347b8d4","title":"Capoeira","description":"A Brazilian martial art that combines dance, acrobatics, and music. Capoeira incorporates kicks, sweeps, and headbutts, and is often played as a game rather than a fight. It has a rich history and is often associated with the Afro-Brazilian community."},{"id":"ed18a2a4-3b3d-401d-bc3b-3f050580f0c8","title":"Krav Maga","description":"An Israeli martial art that focuses on practical self-defense techniques. Krav Maga includes strikes, kicks, and grappling, as well as defenses against weapons and multiple attackers. It is often used by military and law enforcement personnel."},{"id":"ed18a2a4-3b3d-401d-bc3b-3savcvdqwe","title":"Wing Chun","description":"A Chinese martial art that emphasizes close-range combat and quick, simultaneous attack and defense. Wing Chun uses simple and efficient techniques and is often practiced with a partner. It is known for its effectiveness in close-quarters fighting."},{"id":"ed18a2a4-3b3d-401d-bc3b-eqwdsf3424","title":"Boxing","description":"A Western martial art that focuses on punches and footwork. Boxing is often practiced as a sport and is known for its effectiveness in hand-to-hand combat. It has a long history and has produced many legendary fighters."},{"id":"ed18a2a4-3b3d-401d-bc3b-hgnx32zocv","title":"Aikido","description":"A Japanese martial art that emphasizes throws and joint locks to redirect an opponent's energy. Aikido practitioners use fluid and circular movements to defend themselves and neutralize attacks. It is often practiced for self-improvement and spiritual growth."},{"id":"11a1d491-ecc9-47e2-839b-a688bf98396a","title":"Karate","description":"A Japanese martial art that emphasizes striking techniques such as punches, kicks, and knee strikes. Karate also incorporates joint locks and throws for self-defense. It is often practiced as a sport and has become popular around the world."},{"id":"cba6b2ab-8ed5-43d1-b65e-6f7c6e65d347","title":"Jiu-jitsu","description":"A Brazilian martial art that emphasizes ground fighting and submission techniques. Jiu-jitsu practitioners use leverage and technique to overcome opponents, making it effective for self-defense. It has gained popularity in recent years due to its effectiveness in mixed martial arts. 2"},{"id":"be169dbf-3c1c-42ee-9608-a79318156848","title":"kyokoshin","description":"test edit"},{"title":"","description":"","id":"19d02e47-8b2f-40e4-af46-8435a0c3ec62"}]